                h = "赵云",
                i = "张飞",
                j = "马超",
                k = "关羽",
                l = "黄忠",
                m = "关平",
                n = "关兴",
                o = "张苞",
                p = "张翼",
                q = "黄盖",
                r = "刘备",
                s = "黄祖",
                nC7 = "general",
                nC8 = "type",
                nC9 = "wp",
                nDa = "_p",
                nDb = "kp",
                nDc = "Sp",
                t = "单体",
                nDe = "xp",
                u = "nearest",
                v = "closest_end",
                w = "贯穿",
                x = "范围",
                nDj = "Pp",
                nDk = "Ap";
              this["rp"] = [], this["op"] = ["刀", "弓", "枪", "骑"], this["lp"] = ["赵", "云", "张", "飞", "马", "超", "关", "羽", "平", "兴", "黄", "忠", "苞", "翼", "盖", eF, "甄", "宓", "刘", "备"], this["cp"] = 0, this["up"] = 0, this["pp"] = [0, .5, .4, .3, .25], this["yp"] = [0, .5, .4, .3, .25], this["fp"] = [], this["gp"] = [], this["merge"] = [
                ["赵", "云"],
                ["张", "飞"],
                ["马", "超"],
                ["关", "羽"],
                ["黄", "忠"],
                ["关", "平"],
                ["关", "兴"],
                ["张", "苞"],
                ["张", "翼"],
                ["黄", "盖"],
                ["刘", "备"],
                ["黄", eF]
              ], this["familyName"] = ["赵", "张", "马", "关", "黄", "刘"], this["dp"] = ["云", "飞", "超", "羽", "忠", "平", "兴", "苞", "翼", "盖", eF, "备"], this["Lp"] = ["刀", "弓", "枪", "骑"], this["Yc"] = ["赵云", "张飞", "马超", "关羽", "黄忠", "关平", "关兴", "张苞", "张翼", "黄盖", "刘备", "黄祖"], this["Xc"] = [{
                ["general"]: "赵云",
                ["type"]: 1
              }, {
                ["general"]: "张飞",
                ["type"]: 1
              }, {
                ["general"]: "马超",
                ["type"]: 1
              }, {
                ["general"]: "关羽",
                ["type"]: 2
              }, {
                ["general"]: "黄忠",
                ["type"]: 0
              }, {
                ["general"]: "关平",
                ["type"]: 2
              }, {
                ["general"]: "关兴",
                ["type"]: 2
              }, {
                ["general"]: "张苞",
                ["type"]: 1
              }, {
                ["general"]: "张翼",
                ["type"]: 3
              }, {
                ["general"]: "黄盖",
                ["type"]: 3
              }, {
                ["general"]: "刘备",
                ["type"]: 3
              }, {
                ["general"]: "黄祖",
                ["type"]: 0
              }], this["mp"] = [{
                ["wp"]: 1.5,
                ["_p"]: 3,
                ["kp"]: .8,
                ["Sp"]: "单体",
                ["xp"]: "nearest"
              }, {
                ["wp"]: 3.5,
                ["_p"]: 2,
                ["kp"]: .8,
                ["Sp"]: "单体",
                ["xp"]: "closest_end"
              }, {
                ["wp"]: 2.5,
                ["_p"]: 2,
                ["kp"]: .8,
                ["Sp"]: "贯穿",
                ["xp"]: "nearest"
              }, {
                ["wp"]: 2,
                ["_p"]: 2,
                ["kp"]: .8,
                ["Sp"]: "范围",
                ["xp"]: "nearest"
              }], this["Mp"] = [{
                ["wp"]: 2.5,
                ["_p"]: 2,
                ["kp"]: .8,
                ["Pp"]: 3.5,
                ["Ap"]: !0,
                ["Sp"]: "快攻贯穿",
                ["xp"]: "closest_end"
              }, {
                ["wp"]: 2.5,
                ["_p"]: 10,
                ["kp"]: 1,
                ["Pp"]: 3.5,
                ["Ap"]: !0,
                ["Sp"]: "范围",
                ["xp"]: "nearest"
              }, {
                ["wp"]: 2.5,
                ["_p"]: 10,
                ["kp"]: 1,
                ["Pp"]: 3.5,
                ["Ap"]: !0,
                ["Sp"]: "单体",
                ["xp"]: "nearest"
              }, {
                ["wp"]: 2.5,
                ["_p"]: b[1],
                ["kp"]: 1,
                ["Pp"]: 3.5,
                ["Ap"]: !0,
                ["Sp"]: "单体",
                ["xp"]: "nearest"
              }, {
                ["wp"]: 4.5,
                ["_p"]: 6,
                ["kp"]: .8,
                ["Pp"]: 5.5,
                ["Ap"]: !0,
                ["Sp"]: "贯穿",
                ["xp"]: "nearest"
              }, {
                ["wp"]: 2.5,
                ["_p"]: 3,
                ["kp"]: 1,
                ["Pp"]: 3.5,
                ["Ap"]: !1,
                ["Sp"]: "范围",
                ["xp"]: "nearest"
              }, {
                ["wp"]: 2.5,
                ["_p"]: 7,
                ["kp"]: 1,
                ["Pp"]: 3.5,
                ["Ap"]: !1,
                ["Sp"]: "单体",
                ["xp"]: "closest_end"
              }, {
                ["wp"]: 2.5,
                ["_p"]: 7,
                ["kp"]: 1,
                ["Pp"]: 3.5,
                ["Ap"]: !1,
                ["Sp"]: "单体",
                ["xp"]: "closest_end"
              }, {
                ["wp"]: 2.5,
                ["_p"]: 7,
                ["kp"]: 1,
                ["Pp"]: 3.5,
                ["Ap"]: !1,
                ["Sp"]: "单体",
                ["xp"]: "closest_end"
              }, {
                ["wp"]: 2.5,
                ["_p"]: 8,
                ["kp"]: 1,
                ["Pp"]: 3.5,
                ["Ap"]: !1,
                ["Sp"]: "单体",
                ["xp"]: "nearest"
              }, {
                ["wp"]: 2.5,
                ["_p"]: 10,
                ["kp"]: .8,
                ["Pp"]: 3.5,
                ["Ap"]: !0,
                ["Sp"]: "单体",
                ["xp"]: "nearest"
              }, {
                ["wp"]: 3.5,
                ["_p"]: 6,
                ["kp"]: .8,
                ["Pp"]: 3.5,
                ["Ap"]: !1,
                ["Sp"]: "单体",
                ["xp"]: "closest_end"
              }, {
                ["wp"]: 4.5,
                ["_p"]: 2,
                ["kp"]: .8,
                ["Pp"]: 5.5,
                ["Ap"]: !0,
                ["Sp"]: "单体",
                ["xp"]: "closest_end"
              }], this["Ep"] = !1, this["Bp"] = {
                ["wp"]: 2.5,
                ["_p"]: 6,
                ["kp"]: .8,
                ["Pp"]: 3.5,
                ["Ap"]: !1
              }, this["Dp"] = [0, 8, b[8]], this["Ip"] = [0, 10, b[21], b[66], b[171]], this["Cp"] = [0, .3, .2, .15, .1], this["Tp"] = [0, .5, .4, .3, .2], this["Rp"] = [], this["Fp"] = [], this["Op"] = new Map([
                ["刀", [1, 2, 3, 4, 5]],
                ["弓", [1, 2, 3, 4, 5]],
                ["枪", [1, 2, 3, 4, 5]],
                ["骑", [1, 2, 3, 4, 5]],
                ["赵", [7]],
                ["云", [7]],
                ["关", [8]],
                ["羽", [7]],
                ["兴", [4]],
                ["平", [4]],
                ["张", [8]],
                ["飞", [7]],
                ["苞", [4]],
                ["翼", [4]],
                ["黄", [6]],
                ["忠", [6]],
                ["盖", [5]],
                [eF, [4]],
                ["马", [6]],
                ["超", [6]],
                ["刘", [7]],
                ["备", [6]],
                ["农", [1, 2, 3, 4, 5]]
              ]), this["Yp"] = new Map([
                ["赵云", b[14]],
                ["关羽", e],
                ["关平", f],
                ["关兴", f],
                ["马超", g],
                ["张飞", e],
                ["张苞", f],
                ["张翼", f],
                ["黄忠", g],
                ["黄盖", f],
                ["黄祖", f],
                ["刘备", g]
              ]), this["Xp"] = new Map([
                ["赵", ["云"]],
                ["关", ["羽", "平", "兴"]],
                ["马", ["超"]],
                ["张", ["飞", "苞", "翼"]],
                ["黄", ["忠", "盖", eF]],
                ["刘", ["备"]]
              ]), this["Gp"] = null
            }
          };
          ! function() {
            "use strict";
            var a = hr,
              c = a[0],
              d = "defineProperty",
              nDo = "value",
              nDp = "enumerable",
              nDq = "configurable",
              nDr = "writable";
            Object["defineProperty"](b["prototype"], "init", {
              ["value"]() {
                var a = hr,
                  b = a[0],
                  c = "pp",
                  d = "length",
                  e = "fp",
                  f = "push",
                  g = "yp",
                  h = "gp",
                  i = "Cp",
                  j = "Rp",
                  k = "Tp",
                  l = "Fp";
                this["Hp"]();
                for (let a = 0; a < this["pp"]["length"]; a++) 0 != a ? this["fp"]["push"](this["fp"][a - 1] * (1 + this["pp"][a])) : this["fp"]["push"](1);
                for (let a = 0; a < this["yp"]["length"]; a++) 0 != a ? this["gp"]["push"](this["gp"][a - 1] * (1 + this["yp"][a])) : this["gp"]["push"](1);
                for (let a = 0; a < this["Cp"]["length"]; a++) 0 != a ? this["Rp"]["push"](this["Rp"][a - 1] * (1 + this["Cp"][a])) : this["Rp"]["push"](1);
                for (let a = 0; a < this["Tp"]["length"]; a++) 0 != a ? this["Fp"]["push"](this["Fp"][a - 1] * (1 + this["Tp"][a])) : this["Fp"]["push"](1)
